Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAR169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA060" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDL1STRIDE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="GLCDL1STRIDE" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRIDE" edc:desc="" edc:mask="0xffff" edc:name="STRIDE" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA064" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="3" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDL1RES" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDL1RES" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RESY" edc:desc="" edc:mask="0x7ff" edc:name="RESY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RESX" edc:desc="" edc:mask="0x7ff" edc:name="RESX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EA068" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F8EA070" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="4" edc:access="nn------nnnnnnnnnnnnnnnn----nnnn" edc:cname="GLCDL2MODE" edc:desc="" edc:impl="0xc0ffff0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------0000000000000000----0000" edc:name="GLCDL2MODE" edc:nzwidth="32" edc:por="00------0000000000000000----0000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COLORMODE" edc:desc="" edc:mask="0xf" edc:name="COLORMODE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="SRCBLEND" edc:desc="" edc:mask="0xf" edc:name="SRCBLEND" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DESTBLEND" edc:desc="" edc:mask="0xf" edc:name="DESTBLEND" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="ALPHA" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="MULALPHA" edc:desc="" edc:mask="0x1" edc:name="MULALPHA" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FORCEALPHA" edc:desc="" edc:mask="0x1" edc:name="FORCEALPHA" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DISABIFIL" edc:desc="" edc:mask="0x1" edc:name="DISABIFIL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LAYEREN" edc:desc="" edc:mask="0x1" edc:name="LAYEREN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA074" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="4" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDL2START" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDL2START" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STARTY" edc:desc="" edc:mask="0x7ff" edc:name="STARTY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="STARTX" edc:desc="" edc:mask="0x7ff" edc:name="STARTX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA078" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="4" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDL2SIZE" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDL2SIZE" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIZEY" edc:desc="" edc:mask="0x7ff" edc:name="SIZEY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SIZEX" edc:desc="" edc:mask="0x7ff" edc:name="SIZEX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA07C" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDL2BADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDL2BADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:desc="" edc:mask="0xffffffff" edc:name="BASEADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA080" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDL2STRIDE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="GLCDL2STRIDE" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRIDE" edc:desc="" edc:mask="0xffff" edc:name="STRIDE" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA084" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="4" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDL2RES" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDL2RES" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RESY" edc:desc="" edc:mask="0x7ff" edc:name="RESY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RESX" edc:desc="" edc:mask="0x7ff" edc:name="RESX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EA088" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x1F8EA0F8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="n-----------------------------nn" edc:cname="GLCDINT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-----------------------------00" edc:name="GLCDINT" edc:nzwidth="32" edc:por="0-----------------------------00" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VSYNCINT" edc:desc="" edc:mask="0x1" edc:name="VSYNCINT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HSYNCINT" edc:desc="" edc:mask="0x1" edc:name="HSYNCINT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="29"/>
            <edc:SFRFieldDef edc:cname="IRQCON" edc:desc="" edc:mask="0x1" edc:name="IRQCON" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
